<template>
<div>
   <h2>解释说明:</h2>
   <p>{{msg}}</p>
   <hr>
   <p v-html="mode1"></p>
   <hr>
<p v-html="mode2"></p>
   <hr>
   <p v-html="mode3"></p>
   <hr> 
   <p v-html="mode4"></p>
   <hr>
   <p v-html="mode5"></p>
   <hr>

    </div>    
</template>
<script>
export default {
  data() {
    return {
      msg:
        "这是一个类似京东/天猫的电子书城的后台管理系统，可以通过管理员在这里发布，以及修改书本的信息，当每次修改时，都会重新获取本地当前时间。以下说下各模块的作用:",
      mode1:
        "<b style='font-size:20px'>library 书库</b> 为各类书籍的总表，里面有各类书籍的增删查改，这些基础功能，其中，我将总的书籍分为13类，分别为:1.文学、2.传记、3.青春动漫、4.艺术与摄影、5.少儿、6.社会科学、7.历史、8.励志与成功、9.娱乐与体育、10.旅游、11.科技与生活、12.外语学习、13.小说；当然也是因为13个表同时加载的原因，会导致这个模块的加载速度变慢，所以请耐心等待一小会。",
      mode2:
        "<b style='font-size:20px'>User 用户列表</b> 在这个模块中，我的想法是：管理员方面，不会通过这个平台添加，需通过数据库添加，这样是防止有人恶意添加一些无用的用户，并且初始的管理员用户有5个，改表只能有查看，以及修改的功能，在普通用户的表当中，可进行查改删 这些功能，增加的功能，会在另一个地方通过注册的方式添加。",
      mode3:
        "<b style='font-size:20px'>Quite 简称快讯</b> 该模块是用在书城的轮播图，一小块栏目中，想法是，会在轮播中显示最后5个的新闻，但是也会通过发布时间去排序，排出最新的5个新闻，在小栏块也是如此，另外在这个模块中，增删查改也是齐全的.",
      mode4:
        "<b style='font-size:20px'>New 新书榜</b> 该模块赋予查看的功能，并且只返回了数据库表格中的30条信息，原因是：在添加一本书籍时，也会在这个书籍库表中添加，并且始终显示最新添加的30条信息，顾为新书榜。 ",
      mode5:
        "<b style='font-size:20px'>Log 管理员以及普通用户的操作日志</b> 用来记录各类用户操作的表，会以最新的日志排序"
    };
  }
};
</script>
<style>
</style>
